{
  "about": "About Me",
  "profile_name": "My name is Maksim Georgiev Marinov, and some time ago, I decided to change the direction of my life by entering the fascinating world of web development, after years of working in the hospitality industry.",
  "profile_skills": "During my time in hospitality, I acquired valuable skills such as meticulous attention to detail, effective communication, and the ability to solve problems under pressure. These lessons not only shaped me as a professional but also taught me the importance of human relationships, empathy, and adaptability—qualities that I now apply in my new career.",
  "current_stage_description_1": "Today, I find myself in a new phase of my life, exploring and immersing myself in the vast and exciting world of web development through my intensive training at Ironhack.",
  "current_stage_description_2": "My previous experience in hospitality gave me a unique perspective on the importance of teamwork, creativity in offering innovative solutions, and the dedication to ensuring a quality experience—skills I continue to refine in software development.",
  "skills_technologies_intro": "I am a full-stack developer passionate about creating technological solutions that are both functional and visually appealing.",
  "skills_technologies_technologies_trained": "Technologies trained: Git, MongoDB, Tailwind, Bootstrap, Node.js, JavaScript, React, Express, Cloudinary, SQL, AJAX, Axios.",
  "skills_technologies_continued_learning": "My training at Ironhack allowed me to immerse myself in cutting-edge technologies and master both frontend and backend development. Currently, at 42 Barcelona, I am further honing my skills in areas like C, C++, Linux systems, and relational databases.",
  "future_goal": "Every new challenge and project motivates me to keep learning, as I aim to integrate the best of both worlds: technology and attention to detail.",
  "future_opportunity": "I feel fortunate to combine my passion for web development with my dedication to customer service, creating exceptional digital experiences.",
  "future_closing": "As I move forward in this new chapter, I am excited to collaborate on innovative projects and contribute to a future full of possibilities. Thank you for taking the time to learn more about my journey. I look forward to sharing more with you in the future, as this journey has only just begun."
}