{
  "projects": [
    {
  "title": "CreditGoose - Invoice Financing App",
  "date": "06/2025",
  "description": "Developed during a fintech hackathon in Barcelona, this project helps small businesses access fast invoice financing. I contributed as a backend developer. Users can connect their Square account, send invoices, and receive automated funding suggestions powered by an integrated LLM (Goose + Gemini). The app was built collaboratively by a 5-person team using React, Tailwind, Node.js, and Express. Deployed on DigitalOcean App Platform.",
  "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/CreditGoose.png",
  "clientUrl": "https://github.com/mks1313/CreditGoose-react",
  "serverUrl": "https://github.com/mks1313/CreditGoose",
  "liveUrl": "https://credit-goose-react.vercel.app"
    },
    {
      "title": "Nyam Nyam",
      "date": "02/2024 - 03/2024",
      "description": "For my second project, I focused on applying React.js to create a platform for culinary enthusiasts. This project posed challenges, particularly with handling props and integrating frontend and backend. For the backend, I implemented Express.js and secured the app with JWT (JSON Web Token) authentication. I also used Postman to test the API routes. On the frontend, I used FontAwesome icons to enhance the user interface. The project aims to connect people based on their culinary preferences, offering them a platform to find suitable places. It is scalable, and improvements are ongoing, with new features being added.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712354135/project-3/iwh6jjiptyl4ddgeeghh.png",
      "clientUrl": "https://github.com/mks1313/project-3-client",
      "serverUrl": "https://github.com/mks1313/project-3-server",
      "liveUrl": "https://project-3-client.vercel.app/"
    },
    {
      "title": "Historical Events",
      "date": "12/2023 - 01/2024",
      "description": "This was my first project, where I applied my development knowledge to create a platform for history enthusiasts to comment and rate historical topics. I calculated the average ratings using a simple JavaScript formula. The backend was built with Express in Node.js, while the front-end utilized HBS for rendering. For password security, I used bcrypt for hashing, and the data was stored in a MongoDB database. I also incorporated Bootstrap to enhance the user interface and overall experience. It was a rewarding and humbling experience that allowed me to explore my passion for both technology and history.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712350920/project-3/ng0hbm8h1lprezgjnivz.png",
      "clientUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "serverUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "liveUrl": "https://historical-events-crud.vercel.app/"
    }
  ]
}