{
  "title": "Ironhack: Tech Bootcamps in Barcelona",
  "date": "09/2023 - 03/2024",
  "description": "In the bootcamp, we learned basic and advanced concepts, especially in languages such as HTML5, CSS, JavaScript. We applied our knowledge to real projects that we completed ourselves. We used frontend libraries such as React and Axios to make requests to a backend created with the Express framework in the Node.js execution environment. For data storage, we learned to master MongoDB, as well as handling videos and images in Cloudinary. Finally, we deployed the projects on Vercel. Thanks to this training, I feel empowered to face challenges in the world of software development with confidence.",
  "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712145962/project-3/ckdkulxvvihsq1i9h6dx.png",
  "title1": "Lesgaft National State University of Physical Education, Sport and Health, St. Petersburg",
  "date1": "09/1997 - 04/2001",
  "description1": "Faculty of Physical Education",
  "subdescription": "Sport and the training system for athletes in the chosen sport.",
  "title2": "Responsive Web Design",
  "date2": "05/2024 - 06/2024",
  "description2": "freeCodeCamp",
  "image1": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1717881078/project-3/lyji8lulplzqlhisohwc.png",
  "subdescription1": "Obtained a certificate in Responsive Web Design from freeCodeCamp, covering HTML, CSS, Flexbox, Grid, and accessibility best practices.",
  "title3": "42 Barcelona, Telefónica Foundation",
  "date3": "04/2024 - present",
  "description3": "Since April 20204, I have been studying at the School of Development, Campus 42 Barcelona, ​​an innovative environment that promotes self-directed learning through problem solving and collaborative projects, without the traditional structure of teachers or classes. During my training, I have acquired skills in the C and C++ programming languages, in addition to developing skills in system administration, including the installation of virtual machines and advanced command line management.",
  "image2": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1724402225/project-3/ow05aeq063gl6mgwkz3s.jpg"
}
