{
    "about": "Sobre mí",
    "content": "Mi nombre es Maksim Georgiev Marinov, y hace un tiempo decidí cambiar el rumbo de mi vida al adentrarme en el fascinante mundo del desarrollo web, luego de años de trabajar en la industria hotelera. Durante mi tiempo en la hostelería, adquirí habilidades valiosas como la atención meticulosa a los detalles, una comunicación efectiva y la capacidad de resolver problemas bajo presión. Estos aprendizajes no solo me formaron como profesional, sino que también me enseñaron la importancia de las relaciones humanas, la empatía y la adaptabilidad, cualidades que ahora aplico en mi nueva carrera. Hoy, me encuentro en una nueva etapa de mi vida, explorando y sumergiéndome profundamente en el vasto y emocionante mundo del desarrollo web a través de mi formación intensiva en Ironhack Bootcamp. Mi experiencia previa en hospitalidad me ha brindado una visión única sobre la importancia del trabajo en equipo, la creatividad para ofrecer soluciones innovadoras y la dedicación para garantizar una experiencia de calidad, habilidades que continúo perfeccionando en el desarrollo de software. Soy un desarrollador full stack apasionado por la creación de soluciones tecnológicas que sean tanto funcionales como visualmente atractivas. Mi formación en Ironhack me permitió sumergirme en tecnologías de vanguardia y dominar tanto el frontend como el backend, y en 42 Barcelona continúo profundizando en temas como C, C++, sistemas Linux y bases de datos relacionales. Cada nuevo desafío y proyecto me motiva a seguir aprendiendo, mientras busco integrar lo mejor de ambos mundos: la tecnología y la atención al detalle. Me siento afortunado de poder combinar mi pasión por el desarrollo web con mi dedicación al servicio al cliente, creando experiencias digitales excepcionales. A medida que avanzo en este nuevo capítulo, estoy emocionado por colaborar en proyectos innovadores y contribuir a un futuro lleno de posibilidades. Gracias por tomarte el tiempo de conocer un poco más sobre mi viaje. Estoy deseando compartir más contigo en el futuro, ya que este camino solo acaba de comenzar."
  }
  