{
  "about": "Sobre mí",
  "profile_name": "Mi nombre es Maksim Georgiev Marinov, y hace un tiempo decidí cambiar el rumbo de mi vida al entrar en el fascinante mundo del desarrollo web, después de años de trabajar en la industria de la hospitalidad.",
  "profile_skills": "Durante mi tiempo en la hospitalidad, adquirí habilidades valiosas como la atención meticulosa a los detalles, la comunicación efectiva y la capacidad de resolver problemas bajo presión. Estas lecciones no solo me formaron como profesional, sino que también me enseñaron la importancia de las relaciones humanas, la empatía y la adaptabilidad, cualidades que ahora aplico en mi nueva carrera.",
  "current_stage_description_1": "Hoy me encuentro en una nueva etapa de mi vida, explorando y sumergiéndome en el vasto y emocionante mundo del desarrollo web a través de mi formación intensiva en el Bootcamp de Ironhack.",
  "current_stage_description_2": "Mi experiencia previa en la hospitalidad me ha dado una perspectiva única sobre la importancia del trabajo en equipo, la creatividad para ofrecer soluciones innovadoras y la dedicación para garantizar una experiencia de calidad, habilidades que sigo perfeccionando en el desarrollo de software.",
  "skills_technologies_intro": "Soy un desarrollador full stack apasionado por crear soluciones tecnológicas que sean tanto funcionales como visualmente atractivas.",
  "skills_technologies_technologies_trained": "Tecnologías entrenadas: Git, MongoDB, Tailwind, Bootstrap, Node.js, JavaScript, React, Express, Cloudinary, SQL, AJAX, Axios.",
  "skills_technologies_continued_learning": "Mi formación en Ironhack me permitió sumergirme en tecnologías de vanguardia y dominar tanto el frontend como el backend, y actualmente, en 42 Barcelona, sigo perfeccionando mis habilidades en áreas como C, C++, sistemas Linux y bases de datos relacionales.",
  "future_goal": "Cada nuevo desafío y proyecto me motiva a seguir aprendiendo, ya que busco integrar lo mejor de ambos mundos: tecnología y atención al detalle.",
  "future_opportunity": "Me siento afortunado de poder combinar mi pasión por el desarrollo web con mi dedicación al servicio al cliente, creando experiencias digitales excepcionales.",
  "future_closing": "A medida que avanzo en este nuevo capítulo, estoy emocionado de colaborar en proyectos innovadores y contribuir a un futuro lleno de posibilidades. Gracias por tomarte el tiempo de conocer un poco más sobre mi viaje. Espero poder compartir más contigo en el futuro, ya que este camino apenas comienza."
}