{
  "projects": [
    {

      "title": "Nyam Nyam",
      "date": "02/2024 - 03/2024",
      "description": "Para mi segundo proyecto, me concentré en aplicar React.js para crear una plataforma para entusiastas culinarios. Este proyecto planteó desafíos, particularmente en el manejo de props y la integración del frontend y backend. Para el backend, implementé Express.js y protegí la aplicación con autenticación JWT (JSON Web Token). También usé Postman para probar las rutas de la API. En el frontend, usé íconos de FontAwesome para mejorar la interfaz de usuario. El proyecto tiene como objetivo conectar a las personas en función de sus preferencias culinarias, ofreciéndoles una plataforma para encontrar lugares adecuados. Es escalable y se están realizando mejoras en forma continua, con nuevas funciones añadidas.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712354135/project-3/iwh6jjiptyl4ddgeeghh.png",
      "clientUrl": "https://github.com/mks1313/project-3-client",
      "serverUrl": "https://github.com/mks1313/project-3-server",
      "liveUrl": "https://project-3-client.vercel.app/"
    },
    {
      "title": "Historical Events",
      "date": "12/2023 - 01/2024",
      "description": "Este fue mi primer proyecto, en el que apliqué mis conocimientos de desarrollo para crear una plataforma para que los entusiastas de la historia pudieran comentar y calificar temas históricos. Calculé las calificaciones promedio utilizando una fórmula simple de JavaScript. El backend se creó con Express en Node.js, mientras que el frontend utilizó HBS para la representación. Para la seguridad de las contraseñas, utilicé bcrypt para el hash y los datos se almacenaron en una base de datos MongoDB. También incorporé Bootstrap para mejorar la interfaz de usuario y la experiencia general. Fue una experiencia gratificante y humilde que me permitió explorar mi pasión tanto por la tecnología como por la historia.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712350920/project-3/ng0hbm8h1lprezgjnivz.png",
      "clientUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "serverUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "liveUrl": "https://historical-events-crud.vercel.app/"
    }
  ]
}