{
  "title": "Ironhack: Tech Bootcamp in Barcelona",
  "date": "09/2023 - 03/2024",
  "description": "En el bootcamp aprendimos nociones básicas y avanzadas, especialmente en lenguajes como HTML5, CSS, JavaScript. Aplicamos nuestros conocimientos en proyectos reales hechos por nosotros mismos. Utilizamos bibliotecas para frontend como React, y Axios para hacer peticiones al backend hecho con el framework Express en el entorno de ejecución de Node.js. Para el almacenamiento de datos, aprendimos a dominar MongoDB, así como también la gestión de vídeos e imágenes en Cloudinary. Y finalmente, desplegamos los proyectos en Vercel. Gracias a esta formación, me siento capacitado para enfrentar desafíos en el mundo del desarrollo de software con confianza.",
  "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712145962/project-3/ckdkulxvvihsq1i9h6dx.png",
  "title1": "Universidad Estatal Nacional de Educación Física, Deporte y Salud de Lesgaft, San Petersburgo",
  "date1": "09/1997 - 04/2001",
  "description1": "Facultad de Educación Física",
  "subdescription": "El deporte y el sistema de formación de los deportistas en el deporte elegido.",
  "title2": "Responsive Web Design",
  "date2": "05/2024 - 06/2024",
  "description2": "freeCodeCamp",
  "image1": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1717881078/project-3/lyji8lulplzqlhisohwc.png",
  "subdescription1": "Obtuve un certificado en Diseño Web Responsivo de freeCodeCamp, que cubre HTML, CSS, Flexbox, Grid y las mejores prácticas de accesibilidad.",
  "title3": "42 Barcelona, Fundación Telefónica",
  "date3": "04/2024 - presente",
  "description3": "Desde abril del año 2024, estoy cursando estudios en la Escuela de Desarrollo, Campus 42 Barcelona, un entorno innovador que promueve el aprendizaje autodirigido a través de la resolución de problemas y proyectos colaborativos, sin la estructura tradicional de profesores o clases. Durante mi formación, he adquirido competencias en los lenguajes de programación C y C++, además de desarrollar habilidades en administración de sistemas, incluyendo la instalación de máquinas virtuales y el manejo avanzado de la línea de comandos.",
  "image2": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1724402225/project-3/ow05aeq063gl6mgwkz3s.jpg"
}
