{
  "about": "Обо мне",
  "profile_name": "Меня зовут Максим Георгиев Маринов, и некоторое время назад я решил изменить направление своей жизни, войдя в увлекательный мир веб-разработки после многих лет работы в отельном бизнесе.",
  "profile_skills": "За время работы в отельном бизнесе я приобрел ценные навыки, такие как внимание к деталям, эффективную коммуникацию и способность решать проблемы под давлением. Эти уроки не только сформировали меня как профессионала, но и научили важности человеческих отношений, эмпатии и адаптивности — качествам, которые я теперь применяю в своей новой карьере.",
  "current_stage_description_1": "Сегодня я нахожусь в новой фазе своей жизни, исследуя и погружаясь в обширный и захватывающий мир веб-разработки через интенсивное обучение в Ironhack.",
  "current_stage_description_2": "Мой предыдущий опыт в отельном бизнесе дал мне уникальную перспективу важности командной работы, творчества в предложении инновационных решений и преданности обеспечению качественного опыта — навыков, которые я продолжаю совершенствовать в разработке программного обеспечения.",
  "skills_technologies_intro": "Я фулл-стек разработчик, увлеченный созданием технологических решений, которые являются как функциональными, так и визуально привлекательными.",
  "skills_technologies_technologies_trained": "Освоенные технологии: Git, MongoDB, Tailwind, Bootstrap, Node.js, JavaScript, React, Express, Cloudinary, SQL, AJAX, Axios.",
  "skills_technologies_continued_learning": "Мое обучение в Ironhack позволило мне погрузиться в передовые технологии и освоить как фронтенд, так и бэкенд разработку. В настоящее время в 42 Барселона я дополнительно оттачиваю свои навыки в таких областях, как C, C++, системы Linux и реляционные базы данных.",
  "future_goal": "Каждый новый вызов и проект мотивируют меня продолжать учиться, так как я стремлюсь интегрировать лучшее из обоих миров: технологии и внимание к деталям.",
  "future_opportunity": "Я чувствую себя счастливым, объединяя свою страсть к веб-разработке с преданностью обслуживанию клиентов, создавая исключительные цифровые впечатления.",
  "future_closing": "Продвигаясь вперед в этой новой главе, я с нетерпением жду сотрудничества в инновационных проектах и вклада в будущее, полное возможностей. Спасибо, что нашли время узнать больше о моем пути. Я с нетерпением жду возможности поделиться с вами большим в будущем, так как это путешествие только началось.",
  "techStack": {
    "title": "Технологии и Инструменты",
    "frontend": "Фронтенд",
    "backend": "Бэкенд",
    "devops": "DevOps и Инструменты",
    "languages": "Языки и Редакторы",
    "testing": "Тестирование и Качество"
  }
}
