{
    "overview": "Опыт",
    "jobs": [
      {
        "title": "Sensing Tex - Full Stack разработчик",
        "category": "IoT и умные текстильные материалы",
        "description": "Работаю в Sensing Tex, пионере в области умных текстильных материалов и растяжимой электроники на основе ИИ и IoT. Разрабатываю передовые веб-приложения для систем мониторинга здоровья, барометрических платформ и IoT решений. Создаю масштабируемые облачные платформы, интегрирующие аппаратные датчики с визуализацией данных в реальном времени. Реализую адаптивные интерфейсы с React и Tailwind CSS, управляю backend сервисами с Docker и Docker Compose. Работаю с сетевыми протоколами, WebSockets для коммуникации в реальном времени и развертыванием приложений на виртуальных машинах на базе Linux. Использую Git для контроля версий и сотрудничаю над инновационными технологическими решениями для здравоохранения и велнеса, демократизирующими гибкую электронику.",
        "date": "08/2025 - настоящее время",
        "skills": ["React", "Tailwind CSS", "Docker", "Docker Compose", "WebSocket", "Git", "Linux", "VM", "Networking", "IoT", "Cloud Solutions", "JavaScript", "Real-time Systems"]
      },
      {
        "title": "Фриланс IT-разработчик",
        "category": "IT-разработка",
        "description": "С апреля 2024 года я работаю фриланс IT-разработчиком, сотрудничая над веб- и программными проектами. Я использую такие технологии, как JavaScript, MongoDB, Vite, React, C, Node.js, Tailwind CSS и другие для создания масштабируемых и эффективных решений. Мой фокус — на разработке современных приложений, оптимизации процессов и обеспечении исключительного пользовательского опыта. Кроме того, я применяю лучшие практики разработки, такие как автоматизированное тестирование с Cypress и Selenium, и управляю кодом с помощью Git, все в среде Linux для обеспечения наилучшей производительности и надежности.",
        "date": "04/2024 - настоящее время",
        "skills": ["JavaScript", "MongoDB", "Vite", "React", "C", "Linux", "Git", "Node.js", "Tailwind CSS", "Selenium", "Cypress"]
      },                   
      {
        "title": "Отель Оазис. Барселона",
        "category": "Ресепшн",
        "description": "Во время моего опыта работы на ресепшн я выполнял различные задачи, и за годы я освоил многие аспекты профессии. Я особенно преуспеваю в управлении бронированиями и клиентами, обеспечивая плавное и эффективное обслуживание. У меня также есть продвинутые знания двух программ управления отелем (PMS - Property Management System). Я занимаюсь решением проблем, включая регистрацию заезда, выезда, выставление счетов и оказание помощи как по телефону, так и лично для удовлетворения потребностей гостей в любое время.",
        "date": "04/2018 - 10/2023",
        "skills": ["Управление бронированием", "Обслуживание клиентов", "Выставление счетов", "PMS"]
      },
      {
        "title": "Monolith Alimentación España Norte SL",
        "category": "Руководство командой",
        "description": "Как супервайзер в супермаркете, я занимался различными обязанностями, включая контроль запасов, управление кассой, выставление счетов и координацию команды. Я руководил командой из трех человек, создавая совместную и эффективную среду. Я преуспеваю в обслуживании клиентов, предоставляя консультации и обеспечивая положительный опыт в любое время.",
        "date": "07/2015 - 03/2018",
        "skills": ["Контроль запасов", "Управление кассой", "Обслуживание клиентов"]
      },
      {
        "title": "Monolith Alimentación España Norte SL",
        "category": "Экспорт",
        "description": "Как менеджер по экспорту фруктов и овощей в Северную Европу, я управлял широким спектром обязанностей, включая выставление счетов, платежи и переговоры о ценах для максимизации прибыльности. Я тесно работал с логистикой для оптимизации маршрутов, особенно из-за скоропортящегося характера продуктов. Я поддерживал эффективную коммуникацию с поставщиками и клиентами для обеспечения бесперебойной цепочки поставок.",
        "date": "11/2012 - 07/2015",
        "skills": ["Выставление счетов", "Переговоры о ценах", "Логистика", "Управление поставщиками", "Эффективная коммуникация"]
      }
    ]
  }  
