{
  "title": "Проекты",
  "subtitle": "Подборка моих недавних работ и сторонних проектов",
  "projects": [
    {
      "title": "cub3D - 3D игровой движок на основе рейкастинга",
      "date": "07/2025 - 08/2025",
      "description": "Разработан в рамках программы 42 Барселона, cub3D — это сложный проект, вдохновленный классической игрой Wolfenstein 3D. Этот проект реализует движок рейкастинга полностью на C, создавая динамическое 3D графическое представление лабиринта от первого лица. Построенный с использованием графической библиотеки MiniLibX, он обрабатывает рендеринг в реальном времени, наложение текстур, позиционирование спрайтов и движение игрока. Проект углубил мое понимание алгоритмов компьютерной графики, управления памятью и оптимизации низкоуровневого программирования. Он демонстрирует владение математическими концепциями, такими как тригонометрия и векторные вычисления, применяемые в разработке игр.",
      "image": "https://images.unsplash.com/photo-1538481199705-c710c4e965fc?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Milestone-4",
      "serverUrl": "https://github.com/mks1313/Milestone-4",
      "liveUrl": "https://github.com/mks1313/Milestone-4"
    },
    {
      "title": "CreditGoose - Приложение для финансирования счетов",
      "date": "06/2025",
      "description": "Разработано во время финтех-хакатона в Барселоне, этот проект помогает малому бизнесу получить быстрое финансирование счетов. Я участвовал как бэкенд-разработчик. Пользователи могут подключить свой аккаунт Square, отправлять счета и получать автоматизированные предложения финансирования с помощью интегрированного LLM (Goose + Gemini). Приложение было создано командой из 5 человек с использованием React, Tailwind, Node.js и Express. Развернуто на платформе DigitalOcean App Platform.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/CreditGoose.png",
      "clientUrl": "https://github.com/mks1313/CreditGoose-react",
      "serverUrl": "https://github.com/mks1313/CreditGoose",
      "liveUrl": "https://credit-goose-react.vercel.app"
    },
    {
      "title": "Minishell - Воссоздание Unix Shell",
      "date": "02/2025 - 06/2025",
      "description": "Амбициозный проект из 42 Барселона, который включает в себя воссоздание полностью функциональной Unix shell с нуля на C. Это глубокое погружение в системное программирование охватывает создание и управление процессами с fork() и execve(), реализацию конвейеров и перенаправлений (|, <, >, <<, >>), обработку сигналов (SIGINT, SIGQUIT, EOF), расширение переменных окружения, встроенные команды (echo, cd, pwd, export, unset, env, exit) и историю команд. Проект потребовал мастерства в низкоуровневых концепциях программирования, включая файловые дескрипторы, управление процессами, управление памятью, парсинг сложного синтаксиса команд и обработку крайних случаев. Он демонстрирует владение системными вызовами POSIX, межпроцессным взаимодействием и созданием надежных интерфейсов командной строки, имитирующих поведение bash.",
      "image": "https://images.unsplash.com/photo-1629654297299-c8506221ca97?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Minishell",
      "serverUrl": "https://github.com/mks1313/Minishell",
      "liveUrl": "https://github.com/mks1313/Minishell"
    },
    {
      "title": "Philosophers - Проблема обедающих философов",
      "date": "12/2024 - 02/2025",
      "description": "Продвинутый проект 42 Барселона, реализующий решение классической проблемы синхронизации обедающих философов с использованием POSIX потоков. Симулирует N философов, сидящих за круглым столом и делящих вилки, где каждый философ чередует еду, сон и размышления. Реализует синхронизацию с мьютексами для избежания гонки данных, предотвращение дедлока обеспечением порядка получения ресурсов, обнаружение смерти от голода если философ не ест вовремя и условие завершения когда все поели N раз. Проект требует точной работы со временем через gettimeofday(), управления множественными потоками через pthread_create/join, защиты общих данных через pthread_mutex_lock/unlock и оптимизации для предотвращения гонок данных. Демонстрирует мастерство параллельного программирования, синхронизации потоков, предотвращения дедлоков и управления общими ресурсами в многопоточных средах.",
      "image": "https://images.unsplash.com/photo-1534670007418-fbb7f6cf32c3?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Milestone-3",
      "serverUrl": "https://github.com/mks1313/Milestone-3",
      "liveUrl": "https://github.com/mks1313/Milestone-3"
    },
    {
      "title": "get_next_line - Построчное чтение файлов",
      "date": "07/2024 - 08/2024",
      "description": "Проект 42 Барселона, сфокусированный на создании функции, которая читает по одной строке за раз из файлового дескриптора. Реализует эффективное чтение с динамическим буфером (настраиваемый BUFFER_SIZE), управление несколькими файловыми дескрипторами одновременно, статическую память для сохранения состояния между вызовами и поддержку чтения из файлов, stdin и множественных источников. Проект требует тщательной обработки крайних случаев: пустые файлы, строки без финального перевода строки, смена файловых дескрипторов и управление памятью для предотвращения утечек. Эта функция стала фундаментальным инструментом для всех моих последующих проектов, требующих чтения файлов, демонстрируя мастерство динамического управления памятью, указателей, статических переменных и оптимизации чтения I/O.",
      "image": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Milestone-1",
      "serverUrl": "https://github.com/mks1313/Milestone-1",
      "liveUrl": "https://github.com/mks1313/Milestone-1"
    },
    {
      "title": "ft_printf - Реимплементация printf",
      "date": "07/2024 - 08/2024",
      "description": "Проект 42 Барселона, который воссоздает функцию printf из стандартной библиотеки C. Реализует преобразования формата для символов (%c), строк (%s), указателей (%p), десятичных целых (%d, %i), беззнаковых целых (%u), шестнадцатеричных в нижнем и верхнем регистре (%x, %X) и литерального процента (%%). Использует переменные аргументы (va_list, va_start, va_arg, va_end) для обработки переменного числа параметров, управление void указателями для адресов памяти, преобразование чисел в разные системы счисления (десятичная, шестнадцатеричная) и возвращает общее количество напечатанных символов. Проект включает полный набор тестов, сравнивающих вывод с оригинальным printf, обработку крайних случаев (NULL, INT_MIN, INT_MAX, UINT_MAX) и оптимизацию для избежания множественных вызовов write(). Демонстрирует мастерство вариадических аргументов, преобразований типов и форматирования вывода.",
      "image": "https://images.unsplash.com/photo-1587620962725-abab7fe55159?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Milestone-1",
      "serverUrl": "https://github.com/mks1313/Milestone-1",
      "liveUrl": "https://github.com/mks1313/Milestone-1"
    },
    {
      "title": "Libft - Пользовательская стандартная библиотека C",
      "date": "06/2024 - 07/2024",
      "description": "Фундаментальный первый проект 42 Барселона, который включает в себя воссоздание стандартной библиотеки C с нуля. Я реализовал более 40 функций, включая манипуляцию строками (ft_strlen, ft_strcpy, ft_strdup, ft_split), управление памятью (ft_memcpy, ft_memmove, ft_calloc, ft_bzero), преобразование типов (ft_atoi, ft_itoa), проверку символов (ft_isalpha, ft_isdigit, ft_isalnum) и операции со связанными списками (ft_lstnew, ft_lstadd_front, ft_lstmap). Проект также включает полный ft_printf с обработкой переменных аргументов и get_next_line для эффективного чтения файлов построчно. Эта библиотека стала основой для всех моих последующих проектов на C, демонстрируя мастерство работы с указателями, динамическим выделением памяти, Makefile и модульной организацией кода.",
      "image": "https://images.unsplash.com/photo-1517694712202-14dd9538aa97?w=800&h=600&fit=crop",
      "clientUrl": "https://github.com/mks1313/Milestone-0",
      "serverUrl": "https://github.com/mks1313/Milestone-0",
      "liveUrl": "https://github.com/mks1313/Milestone-0"
    },
    {
      "title": "Nyam Nyam",
      "date": "02/2024 - 03/2024",
      "description": "Для своего второго проекта я сосредоточился на применении React.js для создания платформы для любителей кулинарии. Этот проект представил вызовы, особенно с обработкой props и интеграцией фронтенда и бэкенда. Для бэкенда я реализовал Express.js и защитил приложение с помощью JWT (JSON Web Token) аутентификации. Я также использовал Postman для тестирования маршрутов API. На фронтенде я использовал иконки FontAwesome для улучшения пользовательского интерфейса. Проект направлен на соединение людей на основе их кулинарных предпочтений, предлагая им платформу для поиска подходящих мест. Он масштабируемый, и улучшения продолжаются, добавляются новые функции.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712354135/project-3/iwh6jjiptyl4ddgeeghh.png",
      "clientUrl": "https://github.com/mks1313/project-3-client",
      "serverUrl": "https://github.com/mks1313/project-3-server",
      "liveUrl": "https://project-3-client.vercel.app/"
    },
    {
      "title": "Исторические события",
      "date": "12/2023 - 01/2024",
      "description": "Это был мой первый проект, где я применил свои знания разработки для создания платформы для любителей истории для комментирования и оценки исторических тем. Я рассчитал средние оценки, используя простую формулу JavaScript. Бэкенд был создан с Express в Node.js, в то время как фронтенд использовал HBS для рендеринга. Для безопасности паролей я использовал bcrypt для хеширования, а данные хранились в базе данных MongoDB. Я также включил Bootstrap для улучшения пользовательского интерфейса и общего опыта. Это был полезный и скромный опыт, который позволил мне исследовать свою страсть как к технологиям, так и к истории.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712350920/project-3/ng0hbm8h1lprezgjnivz.png",
      "clientUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "serverUrl": "https://github.com/mks1313/Historical-events-CRUD",
      "liveUrl": "https://historical-events-crud.vercel.app/"
    }
  ]
}
