{
  "pageSubtitle": "Моя образовательная траектория и профессиональные сертификаты",
  "timelineEnd": "Путь Непрерывного Обучения",
  "studies": [
    {
      "title": "Сертификат React Challenge (HackerRank)",
      "date": "03/2025",
      "description": "Я завершил 1-часовое техническое испытание на платформе HackerRank, сосредоточенное на разработке React. Во время теста я продемонстрировал навыки создания компонентов, управления состоянием, управления событиями и оптимизации производительности в динамических веб-приложениях. Этот сертификат подтверждает мою способность решать практические проблемы в условиях ограниченного времени.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1741727791/front_react.jpg"
    },
    {
      "title": "Мастерство адаптивного веб-дизайна с Tailwind CSS",
      "date": "01/2025",
      "description": "На протяжении этого курса я получил твердое понимание Tailwind CSS, современного и утилитарного фреймворка дизайна. Я научился эффективно создавать адаптивные и стильные веб-интерфейсы, оптимизируя как время разработки, так и производительность сайта. Я использовал продвинутые техники настройки и лучшие практики для обеспечения визуальной привлекательности, доступности и легкости в поддержке моих проектов. Этот курс позволил мне освоить создание гибких и масштабируемых макетов, адаптированных к потребностям современной веб-разработки.",
      "image": "https://udemy-certificate.s3.amazonaws.com/image/UC-3321c026-22fc-45dd-964d-041d38bdc069.jpg"
    },
    {
      "title": "Автоматизированное и ручное тестирование программного обеспечения",
      "date": "01/2025",
      "description": "Во время моего обучения тестированию программного обеспечения я приобрел знания как в ручном, так и в автоматизированном тестировании, используя такие инструменты, как Selenium и Cypress для обеспечения качества и функциональности приложений. Кроме того, я научился работать по гибким методологиям, таким как Scrum, управляя разработкой через Jira и участвуя в планировании и выполнении спринтов. Мой фокус — на обеспечении оптимального пользовательского опыта, обнаружении и эффективном устранении ошибок.",
      "image": "https://udemy-certificate.s3.amazonaws.com/image/UC-24f006f7-66eb-487e-bbef-16b3b5e1379e.jpg"
    },
    {
      "title": "42 Барселона, Фонд Telefónica",
      "date": "04/2024 - настоящее время",
      "description": "С апреля 2024 года я учусь в Школе разработки, Кампус 42 Барселона, инновационной среде, которая способствует самостоятельному обучению через решение проблем и совместные проекты, без традиционной структуры учителей или классов. Во время моего обучения я приобрел навыки программирования на языках C и C++, в дополнение к развитию навыков системного администрирования, включая установку виртуальных машин и продвинутое управление командной строкой.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1724402225/project-3/ow05aeq063gl6mgwkz3s.jpg"
    },
    {
      "title": "Адаптивный веб-дизайн",
      "date": "05/2024 - 06/2024",
      "description": "Получил сертификат по адаптивному веб-дизайну от freeCodeCamp, охватывающий HTML, CSS, Flexbox, Grid и лучшие практики доступности.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1717881078/project-3/lyji8lulplzqlhisohwc.png"
    },
    {
      "title": "Ironhack: Технологический буткемп в Барселоне",
      "date": "09/2023 - 03/2024",
      "description": "В буткемпе мы изучали базовые и продвинутые концепции, особенно на таких языках, как HTML5, CSS, JavaScript. Мы применяли наши знания к реальным проектам, которые завершали самостоятельно. Мы использовали фронтенд-библиотеки, такие как React и Axios, для выполнения запросов к бэкенду, созданному с помощью фреймворка Express в среде выполнения Node.js. Для хранения данных мы научились владеть MongoDB, а также обрабатывать видео и изображения в Cloudinary. Наконец, мы развернули проекты на Vercel. Благодаря этому обучению я чувствую себя уверенно, чтобы с уверенностью столкнуться с вызовами в мире разработки программного обеспечения.",
      "image": "https://res.cloudinary.com/dnwyfbj7m/image/upload/v1712145962/project-3/ckdkulxvvihsq1i9h6dx.png"
    },
    {
      "title": "Национальный государственный университет физической культуры, спорта и здоровья имени П.Ф. Лесгафта, Санкт-Петербург",
      "date": "09/1997 - 04/2001",
      "description": "Факультет физической культуры",
      "subdescription": "Спорт и система подготовки спортсменов в выбранном виде спорта."
    }
  ]
}
